-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 30, 2023 at 06:17 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.1.17

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `abmgsac`
--

-- --------------------------------------------------------

--
-- Table structure for table `banners`
--

CREATE TABLE `banners` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `file` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `banners`
--

INSERT INTO `banners` (`id`, `file`, `created_at`, `updated_at`) VALUES
(2, 'uploads/banner-images/1703880447658f26ffd025cculture.jpg', '2023-12-29 14:07:27', '2023-12-29 14:07:27'),
(3, 'uploads/banner-images/1703880454658f27067e4e3blab.jpg', '2023-12-29 14:07:34', '2023-12-29 14:07:34');

-- --------------------------------------------------------

--
-- Table structure for table `dress_codes`
--

CREATE TABLE `dress_codes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `file` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `dress_codes`
--

INSERT INTO `dress_codes` (`id`, `title`, `file`, `created_at`, `updated_at`) VALUES
(2, 'zxvzxcv', 'uploads/banner-images/1703882772658f3014118a5Achievement.jpg', '2023-12-29 14:46:12', '2023-12-29 14:46:12'),
(3, 'zxvzxcv', 'uploads/banner-images/1703882778658f301a6a5f4apple-touch-icon.png', '2023-12-29 14:46:18', '2023-12-29 14:46:18');

-- --------------------------------------------------------

--
-- Table structure for table `events`
--

CREATE TABLE `events` (
  `id` varchar(255) NOT NULL,
  `venue_id` varchar(255) DEFAULT NULL,
  `title` varchar(255) DEFAULT NULL,
  `social_media_links` text DEFAULT NULL,
  `max_participent` int(11) DEFAULT NULL,
  `amount` double(8,2) DEFAULT NULL,
  `booking_url` text DEFAULT NULL,
  `description` longtext DEFAULT NULL,
  `banner` longtext DEFAULT NULL,
  `type_of_event` varchar(255) DEFAULT NULL,
  `discount_type` text DEFAULT NULL,
  `is_free` int(11) DEFAULT NULL,
  `discount_value` int(11) DEFAULT NULL,
  `publish_date` date DEFAULT current_timestamp(),
  `start_datetime` timestamp NULL DEFAULT NULL,
  `end_datetime` timestamp NULL DEFAULT NULL,
  `status` varchar(255) DEFAULT NULL,
  `booking_count` varchar(255) DEFAULT NULL,
  `sponsour_min_value` varchar(255) DEFAULT NULL,
  `sponsour_max_value` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `files`
--

CREATE TABLE `files` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `type` varchar(255) DEFAULT NULL,
  `file` text DEFAULT NULL,
  `title` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `files`
--

INSERT INTO `files` (`id`, `type`, `file`, `title`, `description`, `created_at`, `updated_at`) VALUES
(10, 'results', 'uploads/file-images/1703697343658c5bbf9b0caZulfeqar Haider Khan- CV.pdf', 'Zulfeqar Haider Khan- CV.pdf', NULL, '2023-12-27 11:15:43', '2023-12-27 11:15:43'),
(11, 'admission_info', 'uploads/file-images/1703794230658dd6367b2bdLFB MEMBERSHIP FROM.pdf', 'LFB MEMBERSHIP FROM.pdf', NULL, '2023-12-28 14:10:30', '2023-12-28 14:10:30'),
(12, 'glance', 'uploads/file-images/1703880738658f282250d3aAchievement.jpg', NULL, NULL, '2023-12-29 14:12:18', '2023-12-29 14:12:18');

-- --------------------------------------------------------

--
-- Table structure for table `galleries`
--

CREATE TABLE `galleries` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `event_id` varchar(255) NOT NULL,
  `file` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `galleries`
--

INSERT INTO `galleries` (`id`, `event_id`, `file`, `created_at`, `updated_at`) VALUES
(19, '1', 'uploads/banner-images/1703789354658dc32a24bcadress2.jpg', '2023-12-28 12:49:14', '2023-12-28 12:49:14'),
(20, '1', 'uploads/banner-images/1703789354658dc32a25ab7dress3.jpg', '2023-12-28 12:49:14', '2023-12-28 12:49:14'),
(21, '1', 'uploads/banner-images/1703791621658dcc05da22edress3.jpg', '2023-12-28 13:27:01', '2023-12-28 13:27:01'),
(23, '2', 'uploads/banner-images/1703793343658dd2bf64db3info.png', '2023-12-28 13:55:00', '2023-12-28 13:55:43');

-- --------------------------------------------------------

--
-- Table structure for table `gallery_events`
--

CREATE TABLE `gallery_events` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `type` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `gallery_events`
--

INSERT INTO `gallery_events` (`id`, `name`, `type`, `created_at`, `updated_at`) VALUES
(1, '21 marchhhhhh', 'photo', '2023-12-28 11:55:11', '2023-12-28 13:11:46'),
(2, 'Video', 'video', '2023-12-28 13:51:45', '2023-12-28 13:51:45');

-- --------------------------------------------------------

--
-- Table structure for table `governing_bodies`
--

CREATE TABLE `governing_bodies` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `designation` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `governing_bodies`
--

INSERT INTO `governing_bodies` (`id`, `name`, `designation`, `image`, `created_at`, `updated_at`) VALUES
(2, 'asdfasd', 'fasdfasdf', 'uploads/banner-images/1703881312658f2a603a6a2apple-touch-icon.png', '2023-12-29 14:21:52', '2023-12-29 14:21:52');

-- --------------------------------------------------------

--
-- Table structure for table `introductions`
--

CREATE TABLE `introductions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `designation` varchar(255) NOT NULL,
  `file` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `introductions`
--

INSERT INTO `introductions` (`id`, `name`, `designation`, `file`, `created_at`, `updated_at`) VALUES
(1, 'Gavin Sheltonl', 'Optio occaecat quae', 'uploads/introduction-images/17034905876589341bac764dress3.jpg', '2023-12-25 01:49:47', '2023-12-25 01:55:31');

-- --------------------------------------------------------

--
-- Table structure for table `menus`
--

CREATE TABLE `menus` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `speciality` varchar(255) DEFAULT NULL,
  `subtitle` varchar(255) DEFAULT NULL,
  `items` text NOT NULL,
  `price` double(8,2) DEFAULT NULL,
  `tax` varchar(255) DEFAULT NULL,
  `in_ex` varchar(255) DEFAULT NULL,
  `img` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2023_12_16_210736_create_menus_table', 1),
(2, '2023_12_24_171848_create_banners_table', 2),
(3, '2023_12_25_073005_create_introductions_table', 3),
(4, '2023_12_26_153526_create_files_table', 4),
(5, '2023_12_26_153916_create_whies_table', 5),
(6, '2023_12_26_180358_create_governing_bodies_table', 6),
(7, '2023_12_26_180419_create_teaching_staff_table', 7),
(8, '2023_12_27_172622_create_rules_table', 8),
(9, '2023_12_27_173704_create_dress_codes_table', 9),
(10, '2023_12_27_181519_create_galleries_table', 10),
(11, '2023_12_28_174419_create_gallery_events_table', 11),
(12, '2023_12_28_201147_create_notices_table', 12);

-- --------------------------------------------------------

--
-- Table structure for table `notices`
--

CREATE TABLE `notices` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `date` varchar(255) NOT NULL,
  `notice` varchar(255) NOT NULL,
  `file` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `notices`
--

INSERT INTO `notices` (`id`, `date`, `notice`, `file`, `created_at`, `updated_at`) VALUES
(1, '2023-11-30', 'asdfasdfaaaaaaaaaaa', 'uploads/banner-images/1703795185658dd9f1653b8unnamed.jpg', '2023-12-28 14:20:05', '2023-12-28 14:26:25');

-- --------------------------------------------------------

--
-- Table structure for table `rights`
--

CREATE TABLE `rights` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `module` varchar(256) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `rights`
--

INSERT INTO `rights` (`id`, `name`, `module`, `created_at`, `updated_at`) VALUES
(1, 'role.view', 'role', '2023-05-09 22:11:19', '2023-05-09 22:17:58'),
(2, 'role.create', 'role', '2023-05-09 22:11:44', '2023-05-09 22:17:58'),
(3, 'role.edit', 'role', '2023-05-09 22:11:44', '2023-05-09 22:17:58'),
(4, 'role.delete', 'role', '2023-05-09 22:11:44', '2023-05-09 22:17:58'),
(5, 'user.view', 'user', '2023-05-09 22:12:49', '2023-05-09 22:18:12'),
(6, 'user.create', 'user', '2023-05-09 22:12:49', '2023-05-09 22:18:12'),
(7, 'user.edit', 'user', '2023-05-09 22:12:49', '2023-05-09 22:18:12'),
(8, 'user.delete', 'user', '2023-05-09 22:12:49', '2023-05-09 22:18:12'),
(9, 'dashboard.view', 'dashboard', '2023-05-09 22:13:06', '2023-05-09 22:18:25'),
(10, 'dashboard.create', 'dashboard', '2023-05-09 22:13:06', '2023-05-09 22:18:25'),
(11, 'dashboard.edit', 'dashboard', '2023-05-09 22:13:06', '2023-05-09 22:18:25'),
(12, 'dashboard.delete', 'dashboard', '2023-05-09 22:13:06', '2023-05-09 22:18:25'),
(23, 'right.view', 'right', '2023-05-16 06:21:07', '2023-05-16 06:21:07'),
(24, 'right.create', 'right', '2023-05-16 06:21:20', '2023-05-16 06:21:20'),
(25, 'right.edit', 'right', '2023-05-16 06:21:28', '2023-05-16 06:21:28'),
(26, 'right.delete', 'right', '2023-05-16 06:21:36', '2023-05-16 06:21:36'),
(27, 'partner.view', 'partner', '2023-05-17 04:27:42', '2023-05-17 04:27:42'),
(28, 'partner.create', 'partner', '2023-05-17 04:27:53', '2023-05-17 04:27:53'),
(29, 'partner.edit', 'partner', '2023-05-17 04:28:00', '2023-05-17 04:28:00'),
(30, 'partner.delete', 'partner', '2023-05-17 04:28:11', '2023-05-17 04:28:11'),
(35, 'setting.view', 'setting', '2023-05-21 23:31:21', '2023-05-21 23:31:21'),
(37, 'setting.edit', 'setting', '2023-05-21 23:32:15', '2023-05-21 23:32:15'),
(38, 'setting.general', 'setting', '2023-05-21 23:32:50', '2023-05-21 23:32:50'),
(39, 'setting.static-content', 'setting', '2023-05-21 23:51:51', '2023-05-21 23:51:51'),
(48, 'order.view', 'order', '2023-05-24 01:57:26', '2023-05-24 01:57:26'),
(49, 'order.edit', 'order', '2023-05-24 01:57:32', '2023-05-24 01:57:32'),
(50, 'order.create', 'order', '2023-05-24 01:57:38', '2023-05-24 01:57:38'),
(51, 'order.delete', 'order', '2023-05-24 01:57:45', '2023-05-24 01:57:45'),
(60, 'news.view', 'news', '2023-06-06 22:56:51', '2023-06-06 22:56:51'),
(61, 'news.edit', 'news', '2023-06-06 22:56:58', '2023-06-06 22:56:58'),
(62, 'news.create', 'news', '2023-06-06 22:57:05', '2023-06-06 22:57:05'),
(63, 'news.delete', 'news', '2023-06-06 22:57:14', '2023-06-06 22:57:14'),
(76, 'setting.legal-content', 'setting', '2023-07-03 01:10:19', '2023-07-03 01:10:19'),
(93, 'artist.create', 'artist', '2023-11-02 23:45:15', '2023-11-02 23:45:15'),
(94, 'artist.edit', 'artist', '2023-11-02 23:45:22', '2023-11-02 23:45:22'),
(95, 'artist.view', 'artist', '2023-11-02 23:45:30', '2023-11-02 23:45:30'),
(96, 'artist.delete', 'artist', '2023-11-02 23:45:36', '2023-11-02 23:45:36'),
(97, 'sponsor.view', 'sponsor', '2023-11-06 01:15:15', '2023-11-06 01:15:15'),
(98, 'sponsor.create', 'sponsor', '2023-11-06 01:15:25', '2023-11-06 01:15:25'),
(99, 'sponsor.edit', 'sponsor', '2023-11-06 01:15:34', '2023-11-06 01:15:34'),
(100, 'sponsor.delete', 'sponsor', '2023-11-06 01:15:41', '2023-11-06 01:15:41'),
(101, 'gallery.view', 'gallery', '2023-11-06 23:26:56', '2023-11-06 23:26:56'),
(102, 'gallery.create', 'gallery', '2023-11-06 23:27:04', '2023-11-06 23:27:04'),
(103, 'gallery.edit', 'gallery', '2023-11-06 23:27:09', '2023-11-06 23:27:09'),
(104, 'gallery.delete', 'gallery', '2023-11-06 23:27:14', '2023-11-06 23:27:14'),
(105, 'playlist.view', 'playlist', '2023-11-07 01:40:24', '2023-11-07 01:40:24'),
(106, 'playlist.create', 'playlist', '2023-11-07 01:40:30', '2023-11-07 01:40:30'),
(107, 'playlist.edit', 'playlist', '2023-11-07 01:40:35', '2023-11-07 01:40:35'),
(108, 'playlist.delete', 'playlist', '2023-11-07 01:40:40', '2023-11-07 01:40:40'),
(109, 'venue.create', 'venue', '2023-11-08 00:10:00', '2023-11-08 00:10:00'),
(110, 'venue.view', 'venue', '2023-11-08 00:10:07', '2023-11-08 00:10:07'),
(111, 'venue.edit', 'venue', '2023-11-08 00:10:13', '2023-11-08 00:10:13'),
(112, 'venue.delete', 'venue', '2023-11-08 00:10:17', '2023-11-08 00:10:17'),
(113, 'event.view', 'event', '2023-11-08 01:49:28', '2023-11-08 01:49:28'),
(114, 'event.create', 'event', '2023-11-08 01:49:33', '2023-11-08 01:49:33'),
(115, 'event.edit', 'event', '2023-11-08 01:49:38', '2023-11-08 01:49:38'),
(116, 'event.delete', 'event', '2023-11-08 01:49:48', '2023-11-08 01:49:48'),
(120, 'menu.create', 'menu', '2023-12-16 15:23:52', '2023-12-16 15:23:52'),
(121, 'menu.edit', 'menu', '2023-12-16 15:23:59', '2023-12-16 15:23:59'),
(122, 'menu.delete', 'menu', '2023-12-16 15:24:09', '2023-12-16 15:24:09'),
(123, 'menu.view', 'menu', '2023-12-16 15:24:55', '2023-12-16 15:24:55');

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `roles`
--

INSERT INTO `roles` (`id`, `name`, `created_at`, `updated_at`) VALUES
(1, 'Admin', '2023-05-07 11:16:21', '2023-05-07 11:16:21');

-- --------------------------------------------------------

--
-- Table structure for table `role_rights`
--

CREATE TABLE `role_rights` (
  `id` int(11) NOT NULL,
  `role_id` int(11) NOT NULL,
  `right_id` int(11) NOT NULL,
  `permission` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `role_rights`
--

INSERT INTO `role_rights` (`id`, `role_id`, `right_id`, `permission`, `created_at`, `updated_at`) VALUES
(1, 1, 1, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(2, 1, 2, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(3, 1, 3, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(4, 1, 4, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(5, 1, 5, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(6, 1, 6, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(7, 1, 7, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(8, 1, 8, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(9, 1, 9, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(10, 1, 10, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(11, 1, 11, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(12, 1, 12, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(13, 1, 13, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(14, 1, 14, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(15, 1, 15, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(16, 1, 16, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(17, 1, 17, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(18, 1, 18, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(19, 1, 19, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(20, 1, 20, 1, '2023-05-09 23:55:04', '2023-05-16 04:15:06'),
(41, 4, 1, 0, '2023-05-16 04:22:37', '2023-07-11 05:43:55'),
(42, 4, 2, 0, '2023-05-16 04:22:37', '2023-07-11 05:43:55'),
(43, 4, 3, 0, '2023-05-16 04:22:37', '2023-05-16 06:18:24'),
(44, 4, 4, 0, '2023-05-16 04:22:37', '2023-05-16 06:18:24'),
(45, 4, 5, 0, '2023-05-16 04:22:37', '2023-07-11 05:43:55'),
(46, 4, 6, 0, '2023-05-16 04:22:37', '2023-07-11 05:43:55'),
(47, 4, 7, 0, '2023-05-16 04:22:37', '2023-05-16 06:18:24'),
(48, 4, 8, 0, '2023-05-16 04:22:37', '2023-05-16 06:18:24'),
(49, 4, 9, 1, '2023-05-16 04:22:37', '2023-05-16 04:22:37'),
(50, 4, 10, 0, '2023-05-16 04:22:37', '2023-07-11 05:43:55'),
(51, 4, 11, 0, '2023-05-16 04:22:37', '2023-05-16 06:18:24'),
(52, 4, 12, 0, '2023-05-16 04:22:37', '2023-05-16 06:18:24'),
(53, 4, 13, 0, '2023-05-16 04:22:37', '2023-07-11 05:43:55'),
(54, 4, 14, 0, '2023-05-16 04:22:37', '2023-07-11 05:43:55'),
(55, 4, 15, 0, '2023-05-16 04:22:37', '2023-05-16 06:18:24'),
(56, 4, 16, 0, '2023-05-16 04:22:37', '2023-05-16 06:18:24'),
(57, 4, 17, 0, '2023-05-16 04:22:37', '2023-07-11 05:43:55'),
(58, 4, 18, 0, '2023-05-16 04:22:37', '2023-07-11 05:43:55'),
(59, 4, 19, 0, '2023-05-16 04:22:37', '2023-05-16 06:18:24'),
(60, 4, 20, 0, '2023-05-16 04:22:37', '2023-05-16 06:18:24'),
(61, 5, 1, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(62, 5, 2, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(63, 5, 3, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(64, 5, 4, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(65, 5, 5, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(66, 5, 6, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(67, 5, 7, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(68, 5, 8, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(69, 5, 9, 1, '2023-05-16 04:24:43', '2023-05-16 04:24:43'),
(70, 5, 10, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(71, 5, 11, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(72, 5, 12, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(73, 5, 13, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(74, 5, 14, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(75, 5, 15, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(76, 5, 16, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(77, 5, 17, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(78, 5, 18, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(79, 5, 19, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(80, 5, 20, 0, '2023-05-16 04:24:43', '2023-07-26 22:54:46'),
(81, 1, 23, 1, '2023-05-16 22:28:46', '2023-05-16 22:28:46'),
(82, 1, 24, 1, '2023-05-16 22:28:46', '2023-05-16 22:28:46'),
(83, 1, 25, 1, '2023-05-16 22:28:46', '2023-05-16 22:28:46'),
(84, 1, 26, 1, '2023-05-16 22:28:46', '2023-05-16 22:28:46'),
(85, 1, 27, 1, '2023-05-17 04:28:22', '2023-05-17 04:28:22'),
(86, 1, 28, 1, '2023-05-17 04:28:22', '2023-05-17 04:28:22'),
(87, 1, 29, 1, '2023-05-17 04:28:22', '2023-05-17 04:28:22'),
(88, 1, 30, 1, '2023-05-17 04:28:22', '2023-05-17 04:28:22'),
(89, 1, 31, 1, '2023-05-21 01:36:08', '2023-05-21 01:36:08'),
(90, 1, 32, 1, '2023-05-21 01:36:08', '2023-05-21 01:36:08'),
(91, 1, 33, 1, '2023-05-21 01:36:08', '2023-05-21 01:36:08'),
(92, 1, 34, 1, '2023-05-21 01:36:08', '2023-05-21 01:36:08'),
(93, 1, 35, 1, '2023-05-21 23:33:20', '2023-05-21 23:33:20'),
(94, 1, 37, 1, '2023-05-21 23:33:20', '2023-05-21 23:33:20'),
(95, 1, 38, 1, '2023-05-21 23:33:20', '2023-05-21 23:33:20'),
(96, 1, 39, 1, '2023-05-21 23:55:53', '2023-05-21 23:55:53'),
(97, 1, 40, 1, '2023-05-22 05:46:42', '2023-05-22 05:46:42'),
(98, 1, 41, 1, '2023-05-22 05:46:42', '2023-05-22 05:46:42'),
(99, 1, 42, 1, '2023-05-22 05:46:42', '2023-05-22 05:46:42'),
(100, 1, 43, 1, '2023-05-22 05:46:42', '2023-05-22 05:46:42'),
(101, 1, 44, 1, '2023-05-23 06:35:38', '2023-05-23 06:35:38'),
(102, 1, 45, 1, '2023-05-23 06:35:38', '2023-05-23 06:35:38'),
(103, 1, 46, 1, '2023-05-23 06:35:38', '2023-05-23 06:35:38'),
(104, 1, 47, 1, '2023-05-23 06:35:38', '2023-05-23 06:35:38'),
(105, 1, 48, 1, '2023-05-24 03:09:45', '2023-05-24 03:09:45'),
(106, 1, 49, 1, '2023-05-24 03:09:45', '2023-05-24 03:09:45'),
(107, 1, 50, 1, '2023-05-24 03:09:45', '2023-05-24 03:09:45'),
(108, 1, 51, 1, '2023-05-24 03:09:45', '2023-05-24 03:09:45'),
(109, 1, 52, 1, '2023-05-25 05:17:22', '2023-05-25 05:17:22'),
(110, 1, 53, 1, '2023-05-25 05:17:22', '2023-05-25 05:17:22'),
(111, 1, 54, 1, '2023-05-25 05:17:22', '2023-05-25 05:17:22'),
(112, 1, 55, 1, '2023-05-25 05:17:22', '2023-05-25 05:17:22'),
(113, 1, 56, 1, '2023-05-28 23:26:35', '2023-05-28 23:26:35'),
(114, 1, 57, 1, '2023-05-28 23:26:35', '2023-05-28 23:26:35'),
(115, 1, 58, 1, '2023-05-28 23:26:35', '2023-05-28 23:26:35'),
(116, 1, 59, 1, '2023-05-28 23:26:35', '2023-05-28 23:26:35'),
(117, 1, 60, 1, '2023-06-06 22:58:55', '2023-06-06 22:58:55'),
(118, 1, 61, 1, '2023-06-06 22:58:55', '2023-06-06 22:58:55'),
(119, 1, 62, 1, '2023-06-06 22:58:55', '2023-06-06 22:58:55'),
(120, 1, 63, 1, '2023-06-06 22:58:55', '2023-06-06 22:58:55'),
(121, 1, 64, 1, '2023-06-07 22:23:52', '2023-06-07 22:23:52'),
(122, 1, 65, 1, '2023-06-07 22:23:52', '2023-06-07 22:23:52'),
(123, 1, 66, 1, '2023-06-07 22:23:52', '2023-06-07 22:23:52'),
(124, 1, 67, 1, '2023-06-07 22:23:52', '2023-06-07 22:23:52'),
(125, 1, 68, 1, '2023-06-12 04:35:48', '2023-06-12 04:35:48'),
(126, 1, 69, 1, '2023-06-12 04:35:48', '2023-06-12 04:35:48'),
(127, 1, 70, 1, '2023-06-12 04:35:48', '2023-06-12 04:35:48'),
(128, 1, 71, 1, '2023-06-12 04:35:48', '2023-06-12 04:35:48'),
(129, 1, 72, 1, '2023-06-12 22:41:07', '2023-06-12 22:41:07'),
(130, 1, 73, 1, '2023-06-12 22:41:07', '2023-06-12 22:41:07'),
(131, 1, 74, 1, '2023-06-12 22:41:07', '2023-06-12 22:41:07'),
(132, 1, 75, 1, '2023-06-12 22:41:07', '2023-06-12 22:41:07'),
(133, 1, 76, 1, '2023-07-03 01:10:38', '2023-07-03 01:10:38'),
(134, 1, 77, 0, '2023-07-07 05:02:26', '2023-07-09 23:25:44'),
(135, 4, 23, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(136, 4, 24, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(137, 4, 25, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(138, 4, 26, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(139, 4, 27, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(140, 4, 28, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(141, 4, 29, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(142, 4, 30, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(143, 4, 31, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(144, 4, 32, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(145, 4, 33, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(146, 4, 34, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(147, 4, 35, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(148, 4, 37, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(149, 4, 38, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(150, 4, 39, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(151, 4, 40, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(152, 4, 41, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(153, 4, 42, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(154, 4, 43, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(155, 4, 44, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(156, 4, 45, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(157, 4, 46, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(158, 4, 47, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(159, 4, 48, 1, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(160, 4, 49, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(161, 4, 50, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(162, 4, 51, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(163, 4, 52, 1, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(164, 4, 53, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(165, 4, 54, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(166, 4, 55, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(167, 4, 56, 1, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(168, 4, 57, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(169, 4, 58, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(170, 4, 59, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(171, 4, 60, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(172, 4, 61, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(173, 4, 62, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(174, 4, 63, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(175, 4, 64, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(176, 4, 65, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(177, 4, 66, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(178, 4, 67, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(179, 4, 68, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(180, 4, 69, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(181, 4, 70, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(182, 4, 71, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(183, 4, 72, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(184, 4, 73, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(185, 4, 74, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(186, 4, 75, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(187, 4, 76, 0, '2023-07-11 05:43:55', '2023-07-11 05:43:55'),
(188, 5, 23, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(189, 5, 24, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(190, 5, 25, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(191, 5, 26, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(192, 5, 27, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(193, 5, 28, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(194, 5, 29, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(195, 5, 30, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(196, 5, 31, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(197, 5, 32, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(198, 5, 33, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(199, 5, 34, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(200, 5, 35, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(201, 5, 37, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(202, 5, 38, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(203, 5, 39, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(204, 5, 40, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(205, 5, 41, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(206, 5, 42, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(207, 5, 43, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(208, 5, 44, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(209, 5, 45, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(210, 5, 46, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(211, 5, 47, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(212, 5, 48, 1, '2023-07-11 05:44:51', '2023-07-11 05:44:51'),
(213, 5, 49, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(214, 5, 50, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(215, 5, 51, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(216, 5, 52, 1, '2023-07-11 05:44:51', '2023-07-11 05:44:51'),
(217, 5, 53, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(218, 5, 54, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(219, 5, 55, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(220, 5, 56, 1, '2023-07-11 05:44:51', '2023-07-11 05:44:51'),
(221, 5, 57, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(222, 5, 58, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(223, 5, 59, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(224, 5, 60, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(225, 5, 61, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(226, 5, 62, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(227, 5, 63, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(228, 5, 64, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(229, 5, 65, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(230, 5, 66, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(231, 5, 67, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(232, 5, 68, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(233, 5, 69, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(234, 5, 70, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(235, 5, 71, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(236, 5, 72, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(237, 5, 73, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(238, 5, 74, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(239, 5, 75, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(240, 5, 76, 0, '2023-07-11 05:44:51', '2023-07-26 22:54:46'),
(314, 1, 78, 1, '2023-07-14 02:13:57', '2023-07-14 02:13:57'),
(315, 5, 78, 0, '2023-07-26 22:53:59', '2023-07-26 22:54:46'),
(316, 1, 79, 1, '2023-08-11 07:32:54', '2023-08-11 07:32:54'),
(317, 1, 80, 1, '2023-08-11 07:32:54', '2023-08-11 07:32:54'),
(318, 1, 81, 1, '2023-08-11 07:32:54', '2023-08-11 07:32:54'),
(319, 1, 82, 1, '2023-08-11 07:32:54', '2023-08-11 07:32:54'),
(320, 1, 83, 1, '2023-08-22 01:32:09', '2023-08-22 01:32:09'),
(321, 1, 84, 1, '2023-08-22 01:32:09', '2023-08-22 01:32:09'),
(322, 1, 85, 1, '2023-08-22 01:32:09', '2023-08-22 01:32:09'),
(323, 1, 86, 1, '2023-08-22 01:32:09', '2023-08-22 01:32:09'),
(324, 1, 87, 1, '2023-08-25 04:30:58', '2023-08-25 04:30:58'),
(325, 1, 88, 1, '2023-09-21 05:35:01', '2023-09-21 05:35:01'),
(359, 1, 93, 1, '2023-11-02 23:45:48', '2023-11-02 23:45:48'),
(360, 1, 94, 1, '2023-11-02 23:45:48', '2023-11-02 23:45:48'),
(361, 1, 95, 1, '2023-11-02 23:45:48', '2023-11-02 23:45:48'),
(362, 1, 96, 1, '2023-11-02 23:45:48', '2023-11-02 23:45:48'),
(400, 1, 97, 1, '2023-11-06 01:15:52', '2023-11-06 01:15:52'),
(401, 1, 98, 1, '2023-11-06 01:15:52', '2023-11-06 01:15:52'),
(402, 1, 99, 1, '2023-11-06 01:15:52', '2023-11-06 01:15:52'),
(403, 1, 100, 1, '2023-11-06 01:15:52', '2023-11-06 01:15:52'),
(404, 1, 101, 1, '2023-11-06 23:27:31', '2023-11-06 23:27:31'),
(405, 1, 102, 1, '2023-11-06 23:27:31', '2023-11-06 23:27:31'),
(406, 1, 103, 1, '2023-11-06 23:27:31', '2023-11-06 23:27:31'),
(407, 1, 104, 1, '2023-11-06 23:27:31', '2023-11-06 23:27:31'),
(408, 1, 105, 1, '2023-11-07 01:40:56', '2023-11-07 01:40:56'),
(409, 1, 106, 1, '2023-11-07 01:40:56', '2023-11-07 01:40:56'),
(410, 1, 107, 1, '2023-11-07 01:40:56', '2023-11-07 01:40:56'),
(411, 1, 108, 1, '2023-11-07 01:40:56', '2023-11-07 01:40:56'),
(412, 1, 109, 1, '2023-11-08 00:10:31', '2023-11-08 00:10:31'),
(413, 1, 110, 1, '2023-11-08 00:10:31', '2023-11-08 00:10:31'),
(414, 1, 111, 1, '2023-11-08 00:10:31', '2023-11-08 00:10:31'),
(415, 1, 112, 1, '2023-11-08 00:10:31', '2023-11-08 00:10:31'),
(416, 1, 113, 1, '2023-11-08 01:50:25', '2023-11-08 01:50:25'),
(417, 1, 114, 1, '2023-11-08 01:50:25', '2023-11-08 01:50:25'),
(418, 1, 115, 1, '2023-11-08 01:50:25', '2023-11-10 00:49:59'),
(419, 1, 116, 1, '2023-11-08 01:50:25', '2023-11-08 01:50:25'),
(420, 1, 117, 1, '2023-12-16 15:17:01', '2023-12-16 15:17:01'),
(421, 1, 118, 1, '2023-12-16 15:17:01', '2023-12-16 15:17:01'),
(422, 1, 119, 1, '2023-12-16 15:17:01', '2023-12-16 15:17:01'),
(423, 1, 120, 1, '2023-12-16 15:30:21', '2023-12-16 15:30:21'),
(424, 1, 121, 1, '2023-12-16 15:30:21', '2023-12-16 15:30:21'),
(425, 1, 122, 1, '2023-12-16 15:30:21', '2023-12-16 15:30:21'),
(426, 1, 123, 1, '2023-12-16 15:30:21', '2023-12-16 15:30:21');

-- --------------------------------------------------------

--
-- Table structure for table `rules`
--

CREATE TABLE `rules` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `rule` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `rules`
--

INSERT INTO `rules` (`id`, `rule`, `created_at`, `updated_at`) VALUES
(2, 'asdfasdf', '2023-12-28 14:00:05', '2023-12-28 14:00:05'),
(3, 'sdfasdfasdfasdfasdfas', '2023-12-29 14:38:55', '2023-12-29 14:38:55'),
(4, 'asdfasdfasdfasdf', '2023-12-29 14:38:58', '2023-12-29 14:38:58'),
(5, 'asdfasdfasdfasdf', '2023-12-29 14:39:02', '2023-12-29 14:39:02');

-- --------------------------------------------------------

--
-- Table structure for table `settings`
--

CREATE TABLE `settings` (
  `id` int(10) NOT NULL,
  `key` varchar(191) NOT NULL,
  `value` text DEFAULT NULL,
  `is_active` tinyint(4) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `settings`
--

INSERT INTO `settings` (`id`, `key`, `value`, `is_active`, `created_at`, `updated_at`) VALUES
(1, 'application_name', 'ABM', 1, '2023-05-21 22:34:50', '2023-12-23 14:29:55'),
(2, 'site_logo', '170336347565874393649a9logobg.png', 1, '2023-05-21 22:59:19', '2023-12-23 14:31:15'),
(3, 'site_favicon', '1703363525658743c5f1534logobg.png', 1, '2023-05-21 23:09:36', '2023-12-23 14:32:06'),
(4, 'application_phone', '+1 5589 55488 55', 1, '2023-05-21 23:11:44', '2023-12-23 14:32:41'),
(5, 'application_email', 'contact@abmgsac.com', 1, '2023-05-21 23:12:29', '2023-12-23 14:32:41'),
(6, 'application_toll_free', '+1 (905) 790-4567', 1, '2023-05-21 23:20:49', '2023-11-02 00:02:56'),
(7, 'application_fax', '+1 (905) 790-4567', 1, '2023-05-21 23:20:49', '2023-11-02 00:02:56'),
(8, 'application_address', 'মোহাম্মদবাগ চৌরাস্তা, কদমতলী, ঢাকা', 1, '2023-05-21 23:20:49', '2023-12-28 14:50:04'),
(9, 'about_us', '<h1 style=\"font-size: 1.625em; margin: 0.2em 0px 0.5em; padding: 0px; direction: ltr; font-family: Lato, helvetica, arial, sans-serif; font-weight: bold; text-rendering: optimizelegibility; line-height: 1.4;\"><br></h1>', 1, '2023-05-22 01:14:20', '2023-11-02 22:09:40'),
(13, 'terms_and_conditions', '<p class=\"MsoNormal\"><br></p>', 1, '2023-07-03 01:25:51', '2023-11-02 22:21:47'),
(14, 'privacy_policy', '<p class=\"MsoNormal\"><br></p>', 1, '2023-07-03 01:25:51', '2023-11-02 22:21:47'),
(15, 'return_policy', '<p class=\"MsoNormal\"><br></p>', 1, '2023-07-03 01:25:51', '2023-11-02 22:21:47'),
(16, 'facebook_link', 'https://www.facebook.com', 1, '2023-07-03 05:45:16', '2023-12-20 10:38:49'),
(17, 'twitter_link', '#', 1, '2023-07-03 05:45:16', '2023-11-02 00:02:56'),
(18, 'instagram_link', 'https://www.instagram.com', 1, '2023-07-03 05:45:16', '2023-12-20 10:38:49'),
(19, 'linkedin_link', '#', 1, '2023-07-03 05:45:16', '2023-11-02 00:02:56'),
(20, 'youtube_link', '#', 1, '2023-07-03 05:45:16', '2023-11-02 00:02:56'),
(21, 'application_introduction', 'দেশসেরা ডেমরার সামসুল হক খান স্কুল অ্যান্ড কলেজ মাতুয়াইলবাসীর আগ্রহ ও দাবির প্রেক্ষিতে বিশিষ্ট সমাজহিতৈষী ও বিদ্যোৎসাহী আলহাজ্ব সামসুল হক খানের উদ্যোগে ১৯৮৯ খ্রি. প্রতিষ্ঠিত হয়। প্রতিষ্ঠানের আত্মপ্রকাশ ঘটে সামসুল হক খান জুনিয়র হাইস্কুল হিসেবে এবং সীমিত সংখ্যক শিক্ষার্থী ও শিক্ষক নিয়ে। ১৯৯৩ সালে প্রতিষ্ঠান সরকারি স্বীকৃতি লাভ করে, অতঃপর পূর্ণাঙ্গ হাইস্কুলে পরিণত হয়ে ওঠে। নাম ধারণ করে সামসুল হক খান উচ্চ মাধ্যমিক বিদ্যালয়। ১৯৯৫ সালে এমপিওভুক্ত হয় ও প্রথমবারের মতো এসএসসি পরীক্ষায় অবতীর্ণ হয়। ২০০৩ সালে সংযুক্ত হয় মেয়েদের জন্য কলেজ শাখা। আর তখন থেকেই প্রতিষ্ঠানের নতুন নামকরণ সামসুল হক খান স্কুল অ্যান্ড কলেজ। প্রতিষ্ঠানের সর্বশেষ শাখা ইংলিশ ভার্সন উন্মুক্ত হয় ২০১৪ সালে।\n\nসহকারী প্রধান শিক্ষক মো. সোহরাব হোসেন বালকদের দিবা শাখা ও সহকারী প্রধান শিক্ষক মো. আব্দুল মতীন বালিকাদের প্রভাতি শাখার তত্ত্বাবধান ও পরিচালনার দায়িত্বে নিযুক্ত। ইংলিশ ভার্সনের ইনচার্জ মো.আলমগীর হোসেন। কলেজ শাখার ইনচার্জের দায়িত্বে নিযুক্ত আছে মো. মুস্তাফিজুর রহমান(তুহিন), সহকারী অধ্যাপক, গণিত বিভাগ। সামসুল হক খান স্কুল অ্যান্ড কলেজ সহশিক্ষা বিনোদনে দেশের অন্যতম অগ্রগামী শিক্ষাপ্রতিষ্ঠান। স্কাউট গ্রুপসহ ডজন খানেক ক্লাব বিদ্যমান। সামসুল হক খান স্কুল অ্যান্ড কলেজ স্কাউট গ্রুপ একটি সাড়া জাগানো স্কাউট সংগঠন। এছাড়া ইংলিশ ল্যাঙ্গুয়েজ ক্লাব, বিজ্ঞান ক্লাব, আর্ট অ্যান্ড কালচারাল ক্লাব, ডিবেট ক্লাব, স্বদেশ ও বিশ্বভাবনা ক্লাব উল্লেখযোগ্য। শিক্ষার্থীদের মানসিক বিকাশে ক্লাবগুলো অবদান রাখছে।\n\nপ্রতিষ্ঠানের প্রধান কর্ণধার প্রিন্সিপাল মো. মাহবুবুর রহমান মোল্লা। শুরু থেকেই তিনি প্রতিষ্ঠান প্রধান হিসেবে নিযুক্ত আছেন। তাঁর দূরদৃষ্টি ও তীক্ষ্ণধী প্রতিষ্ঠানকে যথাসম্ভব দ্রুত বিস্তার ও বিকশিত করেছে। মো. মাহবুবুর রহমান মোল্লা ডেমরা রোড সংলগ্ন মাতুয়াইলে প্রতিষ্ঠিত ড. মাহবুবুর রহমান মোল্লা কলেজের প্রতিষ্ঠাতা ও চেয়ারম্যান, মাননীয় প্রধানমন্ত্রীর শিক্ষা সহায়তা ট্রাস্টি বোর্ডের সদস্য ও উত্তর কোরিয়ার বৈশ্বিক শান্তি মঞ্চ এইচডব্লিউপিএল এর অ্যাম্বাসেডর।', 1, '2023-07-03 05:45:16', '2023-12-25 08:03:41'),
(22, 'application_number_of_students', '1000', 1, '2023-07-03 05:45:16', '2023-12-25 11:05:17'),
(23, 'application_number_of_teachers', '20', 1, '2023-07-03 05:45:16', '2023-12-25 10:49:50'),
(24, 'application_number_of_scholarships_students', '30', 1, '2023-07-03 05:45:16', '2023-12-25 10:49:50'),
(25, 'application_number_of_gpa5_students', '40', 1, '2023-07-03 05:45:16', '2023-12-25 10:49:50'),
(26, 'application_glance', 'সামসুল হক খান স্কুল অ্যান্ড কলেজের প্রতিষ্ঠাকাল ১৯৮৯ খ্রি.। প্রিন্সিপাল,মো. মাহবুবর রহমান মোল্লা। তিনি একই সাথে মাননীয় প্রধানমন্ত্রীর শিক্ষা সহায়তা ট্রাস্টি বোর্ডের অন্যতম সদস্য ও বাংলাদেশ স্কাউটস, ঢাকা মেট্রোপলিটনের সম্পাদক। প্রতিষ্ঠানের গভর্নিং বডির চেয়ারম্যান আলহাজ্ব শামসুদ্দিন ভূইয়া সেন্টু। প্রভাতি শাখা, দিবা শাখা ও ইংলিশ ভার্সন নিয়ে সামসুল হক খান স্কুল অ্যান্ড কলেজের স্কুল ক্যাম্পাস, পাড়াডগার, মাতুয়াইলে অবস্থিত। প্রভাতি শাখার সহকারী প্রধান শিক্ষক মো. আব্দুল মতিন ও দিবা শাখার সহকারী প্রধান শিক্ষক মো. সোহরাব হোসেন। ইংলিশ ভার্সনের ইনচার্জের দায়িত্বে নিয়োজিত আছেন মো. আলমগীর হোসেন। স্কুল শাখার পরীক্ষা নিয়ন্ত্রক মোহাম্মদ শাহজালাল, সিনিয়র শিক্ষক। স্কুল ক্যাম্পাসের মূল ও পুরাতন ভবনটি ইউ শেইপড ছয়তলা বিশিষ্ট। সরকারি অনুদানের ভবনটি আটতলা ও ইংলিশ ভার্সন ভবনটিও আটতলা। এছাড়া আরও একটি এগারোতলা স্কুল ভবন নির্মাণাধীন।স্কুল ক্যাম্পাসের বহুতল ভবন সংখ্যা মোট ৪টি। বর্তমানে মোট শিক্ষার্থী সংখ্যা প্রায় ১৪০০০।\r\n\r\nকলেজ শাখা নতুন ক্যাম্পাসে, স্কুল ক্যাম্পাসের নিকটবর্তী ৬৫ নং ওয়ার্ড, বাদশা মিয়া রোডে অবস্হিত। কলেজ শাখা উন্মুক্ত হয় ২০০৩ সালে। কলেজর বহুতল ভবনটি আটতলা বিশিষ্ট। শিক্ষার্থী সংখ্যা প্রায় ২৫০০। কলেজ শাখার ইনচার্জ মো. মুস্তাফিজুর রহমান(তুহিন), সহকারী অধ্যাপক, গণিত বিভাগ। পরীক্ষা নিয়ন্ত্রক মো. আনোয়ার হোসেন খান। কলেজ শাখায় সবগুলো বিজ্ঞান বিষয়ের জন্য সমৃদ্ধ ল্যাব রয়েছে।\r\n\r\nপ্রতিষ্ঠানের সহশিক্ষার অঙ্গনটি বেশ বিস্তৃত। সংস্কৃতি চর্চায় উদ্বুদ্ধ করতে শিক্ষার্থীদের জন্য রয়েছে স্কাউট গ্রুপ, ডিবেট ক্লাব, ইংলিশ ল্যাঙ্গুয়েজ ক্লাব, আর্ট অ্যান্ড কালচারাল ক্লাব, বিজ্ঞান ক্লাব, কম্পিউটার ক্লাব,ফুড অ্যান্ড নিউট্রিশন ক্লাব স্বদেশ ও বিশ্বভানা ক্লাব ও ফটোগ্রাফি ক্লাব। শিক্ষার্থীদের সৃজনশীল করে তুলতে প্রতিষ্ঠানের এই প্রয়াস।', 1, '2023-07-03 05:45:16', '2023-12-26 09:44:17'),
(27, 'application_history', 'সামসুল হক খান স্কুল অ্যান্ড কলেজের প্রতিষ্ঠাকাল ১৯৮৯ খ্রি.। প্রিন্সিপাল,মো. মাহবুবর রহমান মোল্লা। তিনি একই সাথে মাননীয় প্রধানমন্ত্রীর শিক্ষা সহায়তা ট্রাস্টি বোর্ডের অন্যতম সদস্য ও বাংলাদেশ স্কাউটস, ঢাকা মেট্রোপলিটনের সম্পাদক। প্রতিষ্ঠানের গভর্নিং বডির চেয়ারম্যান আলহাজ্ব শামসুদ্দিন ভূইয়া সেন্টু। প্রভাতি শাখা, দিবা শাখা ও ইংলিশ ভার্সন নিয়ে সামসুল হক খান স্কুল অ্যান্ড কলেজের স্কুল ক্যাম্পাস, পাড়াডগার, মাতুয়াইলে অবস্থিত। প্রভাতি শাখার সহকারী প্রধান শিক্ষক মো. আব্দুল মতিন ও দিবা শাখার সহকারী প্রধান শিক্ষক মো. সোহরাব হোসেন। ইংলিশ ভার্সনের ইনচার্জের দায়িত্বে নিয়োজিত আছেন মো. আলমগীর হোসেন। স্কুল শাখার পরীক্ষা নিয়ন্ত্রক মোহাম্মদ শাহজালাল, সিনিয়র শিক্ষক। স্কুল ক্যাম্পাসের মূল ও পুরাতন ভবনটি ইউ শেইপড ছয়তলা বিশিষ্ট। সরকারি অনুদানের ভবনটি আটতলা ও ইংলিশ ভার্সন ভবনটিও আটতলা। এছাড়া আরও একটি এগারোতলা স্কুল ভবন নির্মাণাধীন।স্কুল ক্যাম্পাসের বহুতল ভবন সংখ্যা মোট ৪টি। বর্তমানে মোট শিক্ষার্থী সংখ্যা প্রায় ১৪০০০।\r\n\r\nকলেজ শাখা নতুন ক্যাম্পাসে, স্কুল ক্যাম্পাসের নিকটবর্তী ৬৫ নং ওয়ার্ড, বাদশা মিয়া রোডে অবস্হিত। কলেজ শাখা উন্মুক্ত হয় ২০০৩ সালে। কলেজর বহুতল ভবনটি আটতলা বিশিষ্ট। শিক্ষার্থী সংখ্যা প্রায় ২৫০০। কলেজ শাখার ইনচার্জ মো. মুস্তাফিজুর রহমান(তুহিন), সহকারী অধ্যাপক, গণিত বিভাগ। পরীক্ষা নিয়ন্ত্রক মো. আনোয়ার হোসেন খান। কলেজ শাখায় সবগুলো বিজ্ঞান বিষয়ের জন্য সমৃদ্ধ ল্যাব রয়েছে।\r\n\r\nপ্রতিষ্ঠানের সহশিক্ষার অঙ্গনটি বেশ বিস্তৃত। সংস্কৃতি চর্চায় উদ্বুদ্ধ করতে শিক্ষার্থীদের জন্য রয়েছে স্কাউট গ্রুপ, ডিবেট ক্লাব, ইংলিশ ল্যাঙ্গুয়েজ ক্লাব, আর্ট অ্যান্ড কালচারাল ক্লাব, বিজ্ঞান ক্লাব, কম্পিউটার ক্লাব,ফুড অ্যান্ড নিউট্রিশন ক্লাব স্বদেশ ও বিশ্বভানা ক্লাব ও ফটোগ্রাফি ক্লাব। শিক্ষার্থীদের সৃজনশীল করে তুলতে প্রতিষ্ঠানের এই প্রয়াস।', 1, '2023-07-03 05:45:16', '2023-12-26 10:06:42'),
(28, 'application_physics_lab', 'বাদশাহ মিয়া রোডে কলেজ ক্যাম্পাস স্থানান্তরিত হলে ২০২১ সালে গ্রন্থাগার প্রতিষ্ঠিত হয়। কলেজ শাখার গ্রন্থাগার ও গ্রন্থ পরিষদের সভাপতি প্রিন্সিপাল মো. মাহবুবুর রহমান মোল্লা, সচিব মো. মোস্তাফিজুর রহমান তুহিন, সহকারী অধ্যাপক, গণিত বিভাগ ও গ্রন্থগারিক হিসেবে দায়িত্ব নিযুক্ত মোসাম্মত আলপনা আক্তার। সংগ্রহীত গ্রন্থ ও সাময়িকী কলেজের শিক্ষার্থীদের জন্য পাঠ্য ও রেফারেন্স গ্রন্থ, গল্পগ্রন্থ, উপন্যাস, কবিতা, সায়েন্স ফিকশন ইত্যাদি সৃজনশীল গ্রন্থ। এছাড়াও সাপ্তাহিক, পাক্ষিক, নিয়মিত ও অনিয়মিত পত্র – পত্রিকার সংগ্রহ।\r\n\r\nশিক্ষার্থীদের গ্রন্থপাঠে উদ্বুদ্ধ করাই গ্রন্থাগার প্রতিষ্ঠার লক্ষ্য।\r\n\r\nজ্ঞান পিপাসা ছড়িয়ে দিতে গ্রন্থাহার বড় ভূমিকা রাখতে পারে। নিয়মিত নতুন বইয়ের সংস্পর্শ শিক্ষার্থীকে নতুন করে গড়ে তোলে। জীবনে বড় দাবি মেটায় বই। নতুন চিন্তার আহ্বান শিক্ষার্থীকে পৌঁছে দিতেই প্রতিষ্ঠানে গ্রন্থাগার প্রতিষ্ঠিত হয়েছে।', 1, '2023-07-03 05:45:16', '2023-12-29 11:25:13'),
(29, 'application_chemistry_lab', 'বাদশাহ মিয়া রোডে কলেজ ক্যাম্পাস স্থানান্তরিত হলে ২০২১ সালে গ্রন্থাগার প্রতিষ্ঠিত হয়। কলেজ শাখার গ্রন্থাগার ও গ্রন্থ পরিষদের সভাপতি প্রিন্সিপাল মো. মাহবুবুর রহমান মোল্লা, সচিব মো. মোস্তাফিজুর রহমান তুহিন, সহকারী অধ্যাপক, গণিত বিভাগ ও গ্রন্থগারিক হিসেবে দায়িত্ব নিযুক্ত মোসাম্মত আলপনা আক্তার। সংগ্রহীত গ্রন্থ ও সাময়িকী কলেজের শিক্ষার্থীদের জন্য পাঠ্য ও রেফারেন্স গ্রন্থ, গল্পগ্রন্থ, উপন্যাস, কবিতা, সায়েন্স ফিকশন ইত্যাদি সৃজনশীল গ্রন্থ। এছাড়াও সাপ্তাহিক, পাক্ষিক, নিয়মিত ও অনিয়মিত পত্র – পত্রিকার সংগ্রহ।\r\n\r\nশিক্ষার্থীদের গ্রন্থপাঠে উদ্বুদ্ধ করাই গ্রন্থাগার প্রতিষ্ঠার লক্ষ্য।\r\n\r\nজ্ঞান পিপাসা ছড়িয়ে দিতে গ্রন্থাহার বড় ভূমিকা রাখতে পারে। নিয়মিত নতুন বইয়ের সংস্পর্শ শিক্ষার্থীকে নতুন করে গড়ে তোলে। জীবনে বড় দাবি মেটায় বই। নতুন চিন্তার আহ্বান শিক্ষার্থীকে পৌঁছে দিতেই প্রতিষ্ঠানে গ্রন্থাগার প্রতিষ্ঠিত হয়েছে।', 1, '2023-07-03 05:45:16', '2023-12-29 11:25:35'),
(30, 'application_biology_lab', 'বাদশাহ মিয়া রোডে কলেজ ক্যাম্পাস স্থানান্তরিত হলে ২০২১ সালে গ্রন্থাগার প্রতিষ্ঠিত হয়। কলেজ শাখার গ্রন্থাগার ও গ্রন্থ পরিষদের সভাপতি প্রিন্সিপাল মো. মাহবুবুর রহমান মোল্লা, সচিব মো. মোস্তাফিজুর রহমান তুহিন, সহকারী অধ্যাপক, গণিত বিভাগ ও গ্রন্থগারিক হিসেবে দায়িত্ব নিযুক্ত মোসাম্মত আলপনা আক্তার। সংগ্রহীত গ্রন্থ ও সাময়িকী কলেজের শিক্ষার্থীদের জন্য পাঠ্য ও রেফারেন্স গ্রন্থ, গল্পগ্রন্থ, উপন্যাস, কবিতা, সায়েন্স ফিকশন ইত্যাদি সৃজনশীল গ্রন্থ। এছাড়াও সাপ্তাহিক, পাক্ষিক, নিয়মিত ও অনিয়মিত পত্র – পত্রিকার সংগ্রহ।\r\n\r\nশিক্ষার্থীদের গ্রন্থপাঠে উদ্বুদ্ধ করাই গ্রন্থাগার প্রতিষ্ঠার লক্ষ্য।\r\n\r\nজ্ঞান পিপাসা ছড়িয়ে দিতে গ্রন্থাহার বড় ভূমিকা রাখতে পারে। নিয়মিত নতুন বইয়ের সংস্পর্শ শিক্ষার্থীকে নতুন করে গড়ে তোলে। জীবনে বড় দাবি মেটায় বই। নতুন চিন্তার আহ্বান শিক্ষার্থীকে পৌঁছে দিতেই প্রতিষ্ঠানে গ্রন্থাগার প্রতিষ্ঠিত হয়েছে।', 1, '2023-07-03 05:45:16', '2023-12-29 11:26:25'),
(31, 'application_ict_lab', 'যুগোপযোগী শিক্ষার্থী তৈরিতে আইসিটি ক্লাব গুরুত্বপূর্ণ ভূমিকা পালন করতে পারে। প্রতিষ্ঠানের আইসিটি ল্যাবের প্রধান উদ্দেশ্য শিক্ষার্থীদের তথ্য-প্রযুক্তি শিক্ষায় উৎসাহিত করা ও হাতে কলমে তথ্য-প্রযুক্তি সম্পর্কে ধারণা দেওয়া।\r\n\r\nএখন জীবন চলে যোগাযোগে সুতরাং যোগাযোগের সাথে তথ্য প্রযুক্তির সম্পর্ক ওতপ্রোত।', 1, '2023-07-03 05:45:16', '2023-12-26 11:18:03'),
(32, 'application_library', 'বাদশাহ মিয়া রোডে কলেজ ক্যাম্পাস স্থানান্তরিত হলে ২০২১ সালে গ্রন্থাগার প্রতিষ্ঠিত হয়। কলেজ শাখার গ্রন্থাগার ও গ্রন্থ পরিষদের সভাপতি প্রিন্সিপাল মো. মাহবুবুর রহমান মোল্লা, সচিব মো. মোস্তাফিজুর রহমান তুহিন, সহকারী অধ্যাপক, গণিত বিভাগ ও গ্রন্থগারিক হিসেবে দায়িত্ব নিযুক্ত মোসাম্মত আলপনা আক্তার। সংগ্রহীত গ্রন্থ ও সাময়িকী কলেজের শিক্ষার্থীদের জন্য পাঠ্য ও রেফারেন্স গ্রন্থ, গল্পগ্রন্থ, উপন্যাস, কবিতা, সায়েন্স ফিকশন ইত্যাদি সৃজনশীল গ্রন্থ। এছাড়াও সাপ্তাহিক, পাক্ষিক, নিয়মিত ও অনিয়মিত পত্র – পত্রিকার সংগ্রহ।\r\n\r\nশিক্ষার্থীদের গ্রন্থপাঠে উদ্বুদ্ধ করাই গ্রন্থাগার প্রতিষ্ঠার লক্ষ্য।\r\n\r\nজ্ঞান পিপাসা ছড়িয়ে দিতে গ্রন্থাহার বড় ভূমিকা রাখতে পারে। নিয়মিত নতুন বইয়ের সংস্পর্শ শিক্ষার্থীকে নতুন করে গড়ে তোলে। জীবনে বড় দাবি মেটায় বই। নতুন চিন্তার আহ্বান শিক্ষার্থীকে পৌঁছে দিতেই প্রতিষ্ঠানে গ্রন্থাগার প্রতিষ্ঠিত হয়েছে।', 1, '2023-07-03 05:45:16', '2023-12-26 11:24:17'),
(33, 'application_multimedia_classroom', 'শিক্ষায় তথ্যপ্রযুক্তি এই মূলমন্ত্র ধারণ করে, সামসুল হক খান স্কুল অ্যান্ড কলেজের শিক্ষক-শিক্ষার্থীদের জন্য রয়েছে মাল্টিমিডিয়া ক্লাসরুম। এখানে ডিজিটাল কনটেন্টের মাধ্যমে শিক্ষাদান পদ্ধতি এক নবদিগন্তের সূচনা করেছে। পাওয়ার পয়েন্ট প্রেজেন্টেশনের মাধ্যমে একাধিক স্লাইডের সাহায্যে যেকোনো মূর্ত-বিমূর্ত বিষয় অতি সহজেই শিক্ষার্থীদের পাঠদান যেমন আনন্দের হয়, তেমনি হয় সহজবোধ্য।\r\n\r\nএখানে স্মার্টবোর্ড, মাল্টিমিডিয়া প্রজেক্টর, ডিজিটাল কনটেন্টের মাধ্যমে একাধিক স্থির বা চলমান চিত্রের সাহায্যে শিক্ষার্থীদেও যেকোনো বিষয়ে পরিস্কার ধারণা দেওয়া হয়।\r\n\r\nমাল্টিমিডিয়া ক্লাসরুম ও অত্র প্রতিষ্ঠানের শিক্ষকদের তৈরি ডিজিটাল কনটেন্টের মাধ্যমে পাঠদানের ফলে অত্র প্রতিষ্ঠানের শিক্ষার্থীদের শিক্ষাগ্রহণ হয়েছে অনেক বেশি ফলপ্রসূ।', 1, '2023-07-03 05:45:16', '2023-12-29 11:38:49'),
(34, 'application_qip_sms_service', 'শিক্ষার্থীদের ও তাদের অভিভাবকদের উদ্দেশ্যে প্রতিষ্ঠানের তাৎক্ষণিক যাবতীয় তথ্য পৌঁছে দেওয়া হয় মোবাইলের মেসেজ সার্ভিসের মাধ্যমে। এই মেসেজ সেবা কুইক ইনফরমেশন প্রোভাইডার নামে অভিহিত। কিউইপি শিক্ষার্থীর অনুপস্থিতির তথ্য, উত্তরপত্র বাসায় পাঠানোর তথ্য, পরীক্ষার ফল প্রকাশ ও অভিভাবককে আমন্ত্রণের তথ্য, ধর্মীয় ও সামাজিক উৎসব উপলক্ষে শিক্ষার্থীদের শুভেচ্ছা জ্ঞাপন ও প্রতিষ্ঠানের সাময়িক ও দীর্ঘ ছুটির তথ্যসহ বিভিন্ন তথ্য কিউইপি শিক্ষার্থী ও অভিভাবকদের মেসেজের মাধ্যমে দ্রুত পৌঁছে দেয়।\r\n\r\nকিইপি প্রতিষ্ঠানের শিক্ষা কার্যক্রমে শৃঙ্খলা আনয়নে বেশ ভূমিকা রাখে। এরফলে অভিভাবক ও শিক্ষার্থীরা উপকৃত হয়।', 1, '2023-07-03 05:45:16', '2023-12-29 11:41:06'),
(35, 'application_common_room', 'বাদশাহ মিয়া রোডে কলেজ ক্যাম্পাস স্থানান্তরিত হলে ২০২১ সালে গ্রন্থাগার প্রতিষ্ঠিত হয়। কলেজ শাখার গ্রন্থাগার ও গ্রন্থ পরিষদের সভাপতি প্রিন্সিপাল মো. মাহবুবুর রহমান মোল্লা, সচিব মো. মোস্তাফিজুর রহমান তুহিন, সহকারী অধ্যাপক, গণিত বিভাগ ও গ্রন্থগারিক হিসেবে দায়িত্ব নিযুক্ত মোসাম্মত আলপনা আক্তার। সংগ্রহীত গ্রন্থ ও সাময়িকী কলেজের শিক্ষার্থীদের জন্য পাঠ্য ও রেফারেন্স গ্রন্থ, গল্পগ্রন্থ, উপন্যাস, কবিতা, সায়েন্স ফিকশন ইত্যাদি সৃজনশীল গ্রন্থ। এছাড়াও সাপ্তাহিক, পাক্ষিক, নিয়মিত ও অনিয়মিত পত্র – পত্রিকার সংগ্রহ।', 1, '2023-07-03 05:45:16', '2023-12-29 11:42:32'),
(36, 'application_prayer_room', 'বাদশাহ মিয়া রোডে কলেজ ক্যাম্পাস স্থানান্তরিত হলে ২০২১ সালে গ্রন্থাগার প্রতিষ্ঠিত হয়। কলেজ শাখার গ্রন্থাগার ও গ্রন্থ পরিষদের সভাপতি প্রিন্সিপাল মো. মাহবুবুর রহমান মোল্লা, সচিব মো. মোস্তাফিজুর রহমান তুহিন, সহকারী অধ্যাপক, গণিত বিভাগ ও গ্রন্থগারিক হিসেবে দায়িত্ব নিযুক্ত মোসাম্মত আলপনা আক্তার। সংগ্রহীত গ্রন্থ ও সাময়িকী কলেজের শিক্ষার্থীদের জন্য পাঠ্য ও রেফারেন্স গ্রন্থ, গল্পগ্রন্থ, উপন্যাস, কবিতা, সায়েন্স ফিকশন ইত্যাদি সৃজনশীল গ্রন্থ। এছাড়াও সাপ্তাহিক, পাক্ষিক, নিয়মিত ও অনিয়মিত পত্র – পত্রিকার সংগ্রহ।', 1, '2023-07-03 05:45:16', '2023-12-29 11:44:29'),
(37, 'application_principal_message', 'সামসুল হক খান স্কুল অ্যান্ড কলেজের প্রতিষ্ঠাকাল ১৯৮৯ খ্রি.। প্রিন্সিপাল,মো. মাহবুবর রহমান মোল্লা। তিনি একই সাথে মাননীয় প্রধানমন্ত্রীর শিক্ষা সহায়তা ট্রাস্টি বোর্ডের অন্যতম সদস্য ও বাংলাদেশ স্কাউটস, ঢাকা মেট্রোপলিটনের সম্পাদক। প্রতিষ্ঠানের গভর্নিং বডির চেয়ারম্যান আলহাজ্ব শামসুদ্দিন ভূইয়া সেন্টু। প্রভাতি শাখা, দিবা শাখা ও ইংলিশ ভার্সন নিয়ে সামসুল হক খান স্কুল অ্যান্ড কলেজের স্কুল ক্যাম্পাস, পাড়াডগার, মাতুয়াইলে অবস্থিত। প্রভাতি শাখার সহকারী প্রধান শিক্ষক মো. আব্দুল মতিন ও দিবা শাখার সহকারী প্রধান শিক্ষক মো. সোহরাব হোসেন। ইংলিশ ভার্সনের ইনচার্জের দায়িত্বে নিয়োজিত আছেন মো. আলমগীর হোসেন। স্কুল শাখার পরীক্ষা নিয়ন্ত্রক মোহাম্মদ শাহজালাল, সিনিয়র শিক্ষক। স্কুল ক্যাম্পাসের মূল ও পুরাতন ভবনটি ইউ শেইপড ছয়তলা বিশিষ্ট। সরকারি অনুদানের ভবনটি আটতলা ও ইংলিশ ভার্সন ভবনটিও আটতলা। এছাড়া আরও একটি এগারোতলা স্কুল ভবন নির্মাণাধীন।স্কুল ক্যাম্পাসের বহুতল ভবন সংখ্যা মোট ৪টি। বর্তমানে মোট শিক্ষার্থী সংখ্যা প্রায় ১৪০০০।\r\n\r\nকলেজ শাখা নতুন ক্যাম্পাসে, স্কুল ক্যাম্পাসের নিকটবর্তী ৬৫ নং ওয়ার্ড, বাদশা মিয়া রোডে অবস্হিত। কলেজ শাখা উন্মুক্ত হয় ২০০৩ সালে। কলেজর বহুতল ভবনটি আটতলা বিশিষ্ট। শিক্ষার্থী সংখ্যা প্রায় ২৫০০। কলেজ শাখার ইনচার্জ মো. মুস্তাফিজুর রহমান(তুহিন), সহকারী অধ্যাপক, গণিত বিভাগ। পরীক্ষা নিয়ন্ত্রক মো. আনোয়ার হোসেন খান। কলেজ শাখায় সবগুলো বিজ্ঞান বিষয়ের জন্য সমৃদ্ধ ল্যাব রয়েছে।\r\n\r\nপ্রতিষ্ঠানের সহশিক্ষার অঙ্গনটি বেশ বিস্তৃত। সংস্কৃতি চর্চায় উদ্বুদ্ধ করতে শিক্ষার্থীদের জন্য রয়েছে স্কাউট গ্রুপ, ডিবেট ক্লাব, ইংলিশ ল্যাঙ্গুয়েজ ক্লাব, আর্ট অ্যান্ড কালচারাল ক্লাব, বিজ্ঞান ক্লাব, কম্পিউটার ক্লাব,ফুড অ্যান্ড নিউট্রিশন ক্লাব স্বদেশ ও বিশ্বভানা ক্লাব ও ফটোগ্রাফি ক্লাব। শিক্ষার্থীদের সৃজনশীল করে তুলতে প্রতিষ্ঠানের এই প্রয়াস।', 1, '2023-07-03 05:45:16', '2023-12-29 11:18:24');

-- --------------------------------------------------------

--
-- Table structure for table `teaching_staff`
--

CREATE TABLE `teaching_staff` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `designation` varchar(255) DEFAULT NULL,
  `subject` varchar(255) DEFAULT NULL,
  `shift` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `teaching_staff`
--

INSERT INTO `teaching_staff` (`id`, `name`, `designation`, `subject`, `shift`, `image`, `created_at`, `updated_at`) VALUES
(2, 'asdfasdfasdf', 'Principal', 'asdfasdf', 'Day', 'uploads/banner-images/1703881574658f2b661eac2apple-touch-icon.png', '2023-12-29 14:26:14', '2023-12-29 14:26:14'),
(3, 'asdfasdf', 'asdfasdfasdf', 'asdfasdf', 'Morning', 'uploads/banner-images/1703881763658f2c23003a2blab.jpg', '2023-12-29 14:29:23', '2023-12-29 14:29:23'),
(4, 'asdfasdf', 'asdfasdf', 'asdfasdf', 'Day', 'uploads/banner-images/1703881780658f2c34507b4about.jpg', '2023-12-29 14:29:40', '2023-12-29 14:29:40');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` varchar(40) NOT NULL,
  `first_name` varchar(256) DEFAULT NULL,
  `last_name` varchar(256) DEFAULT NULL,
  `email` varchar(256) DEFAULT NULL,
  `phone` varchar(100) DEFAULT NULL,
  `role` int(11) DEFAULT NULL,
  `password` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `first_name`, `last_name`, `email`, `phone`, `role`, `password`, `created_at`, `updated_at`) VALUES
('1', 'System', 'admin', 'admin@gmail.com', '01847382920', 1, '$2y$10$TVqaQ4yRMQmqWX52RmpuoeB89oJE1Hm7T6ru14dLsGQfFadMfgSja', '2023-05-07 11:15:50', '2023-11-02 22:01:52');

-- --------------------------------------------------------

--
-- Table structure for table `whies`
--

CREATE TABLE `whies` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `image` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `whies`
--

INSERT INTO `whies` (`id`, `title`, `description`, `image`, `created_at`, `updated_at`) VALUES
(1, 'Titles', 'description', 'uploads/banner-images/1703613430658b13f6527beclab2.jpg', '2023-12-26 11:57:10', '2023-12-26 11:59:48');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `banners`
--
ALTER TABLE `banners`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `dress_codes`
--
ALTER TABLE `dress_codes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `events`
--
ALTER TABLE `events`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `files`
--
ALTER TABLE `files`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `galleries`
--
ALTER TABLE `galleries`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `gallery_events`
--
ALTER TABLE `gallery_events`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `governing_bodies`
--
ALTER TABLE `governing_bodies`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `introductions`
--
ALTER TABLE `introductions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `menus`
--
ALTER TABLE `menus`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `notices`
--
ALTER TABLE `notices`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `rights`
--
ALTER TABLE `rights`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `role_rights`
--
ALTER TABLE `role_rights`
  ADD PRIMARY KEY (`id`),
  ADD KEY `role_id` (`role_id`,`right_id`),
  ADD KEY `right_id` (`right_id`);

--
-- Indexes for table `rules`
--
ALTER TABLE `rules`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `teaching_staff`
--
ALTER TABLE `teaching_staff`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `role` (`role`);

--
-- Indexes for table `whies`
--
ALTER TABLE `whies`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `banners`
--
ALTER TABLE `banners`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `dress_codes`
--
ALTER TABLE `dress_codes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `files`
--
ALTER TABLE `files`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `galleries`
--
ALTER TABLE `galleries`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `gallery_events`
--
ALTER TABLE `gallery_events`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `governing_bodies`
--
ALTER TABLE `governing_bodies`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `introductions`
--
ALTER TABLE `introductions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `menus`
--
ALTER TABLE `menus`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `notices`
--
ALTER TABLE `notices`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `rights`
--
ALTER TABLE `rights`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=124;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `role_rights`
--
ALTER TABLE `role_rights`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=427;

--
-- AUTO_INCREMENT for table `rules`
--
ALTER TABLE `rules`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `settings`
--
ALTER TABLE `settings`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- AUTO_INCREMENT for table `teaching_staff`
--
ALTER TABLE `teaching_staff`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `whies`
--
ALTER TABLE `whies`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
