@extends('frontend.include.app')
@section('content')
<section>
    <div class="container">
        <div class="row">
            <div class="section-title">
                <!-- <h2>About</h2> -->
                <h3>  <span> ABM At a Glance </span></h3>
            </div>
            <div>
                <p>
                    সামসুল হক খান স্কুল অ্যান্ড কলেজের প্রতিষ্ঠাকাল ১৯৮৯ খ্রি.। প্রিন্সিপাল,মো. মাহবুবর রহমান মোল্লা। তিনি একই সাথে মাননীয় প্রধানমন্ত্রীর শিক্ষা সহায়তা ট্রাস্টি বোর্ডের অন্যতম সদস্য ও বাংলাদেশ স্কাউটস, ঢাকা মেট্রোপলিটনের সম্পাদক।  প্রতিষ্ঠানের গভর্নিং বডির চেয়ারম্যান আলহাজ্ব শামসুদ্দিন ভূইয়া সেন্টু।    প্রভাতি শাখা, দিবা শাখা ও ইংলিশ ভার্সন নিয়ে সামসুল হক খান স্কুল অ্যান্ড কলেজের  স্কুল ক্যাম্পাস, পাড়াডগার, মাতুয়াইলে অবস্থিত। প্রভাতি শাখার সহকারী প্রধান শিক্ষক মো.  আব্দুল মতিন ও দিবা শাখার সহকারী প্রধান শিক্ষক  মো. সোহরাব হোসেন। ইংলিশ ভার্সনের ইনচার্জের দায়িত্বে নিয়োজিত আছেন মো. আলমগীর হোসেন। স্কুল শাখার  পরীক্ষা নিয়ন্ত্রক মোহাম্মদ শাহজালাল, সিনিয়র শিক্ষক।  স্কুল ক্যাম্পাসের  মূল ও পুরাতন  ভবনটি ইউ শেইপড ছয়তলা বিশিষ্ট। সরকারি অনুদানের ভবনটি আটতলা ও  ইংলিশ ভার্সন ভবনটিও  আটতলা।  এছাড়া আরও একটি এগারোতলা স্কুল ভবন নির্মাণাধীন।স্কুল ক্যাম্পাসের  বহুতল ভবন সংখ্যা মোট ৪টি।  বর্তমানে মোট শিক্ষার্থী সংখ্যা প্রায়  ১৪০০০। 
                </p>

                <p>
                    কলেজ শাখা নতুন  ক্যাম্পাসে,  স্কুল ক্যাম্পাসের নিকটবর্তী ৬৫ নং ওয়ার্ড, বাদশা মিয়া রোডে অবস্হিত।  কলেজ শাখা উন্মুক্ত হয় ২০০৩ সালে। কলেজর বহুতল  ভবনটি আটতলা বিশিষ্ট।  শিক্ষার্থী সংখ্যা প্রায় ২৫০০। কলেজ শাখার ইনচার্জ মো. মুস্তাফিজুর রহমান(তুহিন), সহকারী অধ্যাপক, গণিত বিভাগ।  পরীক্ষা নিয়ন্ত্রক মো. আনোয়ার হোসেন খান। কলেজ শাখায় সবগুলো বিজ্ঞান বিষয়ের  জন্য  সমৃদ্ধ  ল্যাব রয়েছে।
                </p>

                <p>
                    প্রতিষ্ঠানের সহশিক্ষার অঙ্গনটি বেশ বিস্তৃত। সংস্কৃতি চর্চায় উদ্বুদ্ধ করতে শিক্ষার্থীদের জন্য রয়েছে স্কাউট গ্রুপ, ডিবেট ক্লাব, ইংলিশ ল্যাঙ্গুয়েজ ক্লাব, আর্ট অ্যান্ড কালচারাল ক্লাব, বিজ্ঞান ক্লাব, কম্পিউটার ক্লাব,ফুড অ্যান্ড নিউট্রিশন ক্লাব স্বদেশ ও বিশ্বভানা ক্লাব ও  ফটোগ্রাফি ক্লাব।  শিক্ষার্থীদের সৃজনশীল করে তুলতে প্রতিষ্ঠানের এই প্রয়াস। 
                </p>
            </div>

            <div class="row">
               <div class="col-lg-6">
                 <div class="glance-img">
                    <img src="{{ asset('assets/img/hero-bg3.jpg') }}">
                 </div>
               </div>
               <div class="col-lg-6">
                <div class="glance-img">
                    <img src="{{ asset('assets/img/hero-bg3.jpg') }}">
                 </div>
               </div>
            </div>
           
        </div>
    </div>
  </section>
@endsection