@extends('frontend.include.app')
@section('content')
<section>
    <div class="container">
        <div class="row">
            <div class="section-title">
                <!-- <h2>About</h2> -->
                <h3>  <span> Library </span></h3>
            </div>
            <div>
                <p>
                    বাদশাহ মিয়া রোডে কলেজ ক্যাম্পাস স্থানান্তরিত হলে ২০২১ সালে গ্রন্থাগার প্রতিষ্ঠিত হয়। কলেজ শাখার গ্রন্থাগার ও গ্রন্থ পরিষদের সভাপতি প্রিন্সিপাল মো. মাহবুবুর রহমান মোল্লা, সচিব মো. মোস্তাফিজুর রহমান তুহিন, সহকারী অধ্যাপক, গণিত বিভাগ ও গ্রন্থগারিক হিসেবে দায়িত্ব নিযুক্ত মোসাম্মত আলপনা আক্তার। সংগ্রহীত গ্রন্থ ও সাময়িকী কলেজের শিক্ষার্থীদের জন্য পাঠ্য ও রেফারেন্স গ্রন্থ, গল্পগ্রন্থ,  উপন্যাস,  কবিতা, সায়েন্স ফিকশন  ইত্যাদি সৃজনশীল গ্রন্থ। এছাড়াও সাপ্তাহিক, পাক্ষিক, নিয়মিত  ও অনিয়মিত পত্র – পত্রিকার সংগ্রহ।
                </p>

                <p>
                    শিক্ষার্থীদের গ্রন্থপাঠে উদ্বুদ্ধ করাই গ্রন্থাগার প্রতিষ্ঠার লক্ষ্য।
                </p>

                <p>
                    জ্ঞান পিপাসা ছড়িয়ে দিতে গ্রন্থাহার বড় ভূমিকা রাখতে পারে। নিয়মিত নতুন বইয়ের সংস্পর্শ শিক্ষার্থীকে নতুন করে গড়ে তোলে। জীবনে বড় দাবি মেটায় বই। নতুন চিন্তার আহ্বান শিক্ষার্থীকে পৌঁছে দিতেই  প্রতিষ্ঠানে গ্রন্থাগার প্রতিষ্ঠিত হয়েছে।
                </p>
            </div>

            <div class="col-lg-12 f-body">
                <img class="f-img" src="{{ asset('assets/img/library.jpg') }}">
            </div>
           
        </div>
    </div>
  </section>
@endsection