@extends('frontend.include.app')
@section('content')
<section>
    <div class="container">
        <div class="row">
            <div class="section-title">
                <!-- <h2>About</h2> -->
                <h3>  <span> Multi-Media Classroom </span></h3>
            </div>
            <div>
                <p>
                    শিক্ষায় তথ্যপ্রযুক্তি এই মূলমন্ত্র ধারণ করে, সামসুল হক খান স্কুল অ্যান্ড কলেজের শিক্ষক-শিক্ষার্থীদের জন্য রয়েছে মাল্টিমিডিয়া ক্লাসরুম। এখানে ডিজিটাল কনটেন্টের মাধ্যমে শিক্ষাদান পদ্ধতি এক নবদিগন্তের সূচনা করেছে। পাওয়ার পয়েন্ট প্রেজেন্টেশনের মাধ্যমে একাধিক স্লাইডের সাহায্যে যেকোনো মূর্ত-বিমূর্ত বিষয় অতি সহজেই শিক্ষার্থীদের পাঠদান যেমন আনন্দের হয়, তেমনি হয় সহজবোধ্য।
                </p>

                <p>
                    এখানে স্মার্টবোর্ড, মাল্টিমিডিয়া প্রজেক্টর, ডিজিটাল কনটেন্টের মাধ্যমে একাধিক স্থির বা চলমান চিত্রের সাহায্যে শিক্ষার্থীদেও যেকোনো বিষয়ে পরিস্কার ধারণা দেওয়া হয়।
                </p>

                <p>
                    মাল্টিমিডিয়া ক্লাসরুম ও অত্র প্রতিষ্ঠানের শিক্ষকদের তৈরি ডিজিটাল কনটেন্টের মাধ্যমে পাঠদানের ফলে অত্র প্রতিষ্ঠানের শিক্ষার্থীদের শিক্ষাগ্রহণ হয়েছে অনেক বেশি ফলপ্রসূ।
                </p>
            </div>

            <div class="col-lg-12 f-body">
                <img class="f-img" src="{{ asset('assets/img/mmclass.png') }}">
            </div>
           
        </div>
    </div>
  </section>
@endsection