@extends('frontend.include.app')
@section('content')
<section>
    <div class="container">
        <div class="row">
            <div class="section-title">
                <!-- <h2>About</h2> -->
                <h3>  <span> QIP SMS Service </span></h3>
            </div>
            <div>
                <p>
                    শিক্ষার্থীদের ও তাদের অভিভাবকদের  উদ্দেশ্যে প্রতিষ্ঠানের তাৎক্ষণিক যাবতীয় তথ্য পৌঁছে দেওয়া হয় মোবাইলের মেসেজ সার্ভিসের মাধ্যমে।  এই মেসেজ  সেবা কুইক ইনফরমেশন প্রোভাইডার নামে অভিহিত। কিউইপি শিক্ষার্থীর অনুপস্থিতির তথ্য, উত্তরপত্র বাসায় পাঠানোর তথ্য, পরীক্ষার ফল প্রকাশ ও অভিভাবককে আমন্ত্রণের তথ্য, ধর্মীয় ও সামাজিক উৎসব উপলক্ষে শিক্ষার্থীদের শুভেচ্ছা জ্ঞাপন ও প্রতিষ্ঠানের সাময়িক ও দীর্ঘ ছুটির তথ্যসহ বিভিন্ন তথ্য কিউইপি শিক্ষার্থী ও অভিভাবকদের  মেসেজের মাধ্যমে দ্রুত পৌঁছে দেয়।
                </p>

                <p>
                    কিইপি প্রতিষ্ঠানের শিক্ষা কার্যক্রমে  শৃঙ্খলা আনয়নে বেশ ভূমিকা রাখে। এরফলে অভিভাবক ও শিক্ষার্থীরা উপকৃত হয়।
                </p>
            </div>
           
        </div>
    </div>
  </section>
@endsection