@extends('frontend.include.app')
@section('content')
<section>
    <div class="container" data-aos="fade-up">
      <div class="section-title">
        <!-- <h2>About</h2> -->
        <h3>প্রতিষ্ঠানের <span> নিয়মাবলী</span></h3>
      </div>

      <div class="row skills-content">

        <div class="col-lg-6 rules">
          <ul>
            <li>হাত ও পায়ের নখ বড় রাখা যাবে না এবং নখে কোন প্রকার রং করা যাবে না। </li>
            <li>সর্বপ্রকার রাজনৈতিক কর্মকান্ড, মারামারি, কোনপ্রকার আপত্তিকর কথা ও অঙ্গ-ভঙ্গি এবং মিথ্যার আশ্রয় নেয়া যাবে না। </li>
            <li>শিক্ষক/শিক্ষিকা , কর্মকর্তা ও কর্মচারীদের সাথে খারাপ আচরণ করা যাবে না।</li>
            <li>প্রতিষ্ঠান, রাষ্ট্র , সমাজ ও পিতা- মাতার সুনাম ক্ষুন্ন হয় এমন কর্মকান্ড থেকে প্রত্যেক ছাত্র/ছাত্রীকে বিরত থাকতে হবে। </li>
            <li>প্রতিষ্ঠানের কোন সম্পদ নষ্ট করা যাবে না।  ক্লাশে কোন বিশৃঙ্খলা , দেয়াল নষ্ট করা ও বেঞ্চে লেখালেখি করা যাবে না।</li>
            <li>সিটি,মাসিক এবং সেমিস্টার পরীক্ষায় অংশগ্রহণ বাধ্যতামূলক। পরীক্ষায় অনুপস্থিতির যথাযথ কারণ দর্শাতে পারলে জরিমানা সহ পূনঃ পরীক্ষা নেয় হবে। অন্যথায় পরীক্ষায় অনুপস্থিতি দেখানো হবে। </li>
          </ul>
        </div>

        <div class="col-lg-6 rules">

          <li>ছাত্র ও ছাত্রীদের নির্ধারিত ইউনিফর্ম পরিধান করতে হবে ।</li>
          <li>ক্লাশ শুরু হওয়ার কমপক্ষে ১০মিনিট পূর্বে স্কুলে উপস্থিত থাকতে হবে । </li>
          <li>প্রতিষ্ঠানে ছাত্র/ছাত্রীদের ৯৫% উপস্থিতি বাধ্যতামূলক ।</li>
          <li>বাবা-মা , শিক্ষক/শিক্ষিকা সহ সকল শুভাকাঙ্খীদের সালাম দিতে হবে।</li>
          <li>স্কুলে সর্বপ্রকার মোবাইল, এমপিথ্রি, অন্য কোন ইলেক্ট্রনিক্স ডিভাইস, নেইল কাটার, ছুরি, স্টীলের স্কেল ও কোন প্রকার প্রসাধনী সামগ্রী আনা বা ব্যবহার করা যাবে না।</li>
          <li>ছেলেদের চুল (আর্ম কাটিং)এবং মেয়েদের চুল বেনি করে আসতে হবে। চুলে কোন প্রকার রং করা যাবে না ।</li>
          <li>স্কুল ছুটির ১০ থেকে ১৫ মিনিট এর মধ্যে স্কুল ক্যাম্পাস ত্যাগ করতে হবে। </li>

        </div>

      </div>

    </div>
  </section>
@endsection